//index.js
//获取应用实例
var app = getApp();
Page({
  data: {
    //轮播图配置
    autoplay: true,
    interval: 3000,
    duration: 1200,
    currentAddress: "定位中...",
    loading: true,
    imgUrls: [
      "../../images/headImg2.png", 
      "../../images/compute.png",
      "../../images/headImg2.png"
    ]
  },

  onLoad: function() { 
    var that = this;

    //获取当前位置经纬度
    that.setData({
      currentAddress: "上海",
      loading: true
    })

    // 滚动数据配置
    var rollData = [
      "139****2396在手机贷成功贷款5000元",
      "136****3365在信用贷成功贷款2000元",
      "159****9685在手机贷成功贷款3000元",
      "137****4867在农户贷成功贷款6000元",
      "156****5530在法人贷成功贷款9000元",
      "158****6940在保单贷成功贷款4000元",
      "153****3364在热门网贷成功贷款3000元",
      "157****2564在大学生创业贷款成功贷款10000元",
      "139****2396在手机贷成功贷款5000元",
      "136****3365在信用贷成功贷款2000元",
      "159****9685在手机贷成功贷款3000元",
      "137****4867在农户贷成功贷款6000元",
      "156****5530在法人贷成功贷款9000元",
      "158****6940在保单贷成功贷款4000元",
      "153****3364在热门网贷成功贷款3000元"
    ];

    that.setData({
      rollData: rollData
    })
  }
})